# CheckAnalyticalModelAsset Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
StructuralSettings..::..CheckAnalyticalModelAsset Property
StructuralSettings Class See Also
---
Whether to check for valid Asset within the Material of associated Physical Element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool CheckAnalyticalModelAsset { get; set; }
```

Visual Basic
---
```text
Public Property CheckAnalyticalModelAsset As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool CheckAnalyticalModelAsset {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace